responseTemplates_old/PrUsQu.xml

<ns2:Envelope xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="urn:ucbru:gbo:v3" xmlns:ns3="urn:ucbru:gbo:v3:st" xmlns:ns6="urn:ucbru:gbo:v5:spdep" xmlns:ns20="http://mfms.ru/mfmsgate/push/devices" xmlns:ns5="urn:ucbru:gbo:v5:loan" xmlns:ns8="urn:ucbru:gbo:v5:card" xmlns:ns7="urn:ucbru:gbo:v5:acc" xmlns:ns13="urn:ucbru:gbo:v5:push:devices:response" xmlns:ns9="urn:ucbru:gbo:v5:cif" xmlns:ns12="urn:ucbru:gbo:v5:push:devices:request" xmlns:ns11="urn:ucbru:gbo:v5:ordst" xmlns:ns10="urn:ucbru:gbo:v5:docst" xmlns:ns17="urn:imb:gbo:BSCardStm" xmlns:ns16="urn:ucbru:gbo:v4" xmlns:ns15="urn:ucbru:gbo:v5" xmlns:ns14="urn:ucbru:gbo:v5:sdpmt" xmlns:ns19="urn:ucbru:esb:srv:sms" xmlns:ns18="urn:imb:gbo:BSCardAuthorization">
    <ns2:Header>
        <ns15:UCBRUHeaders>
            <ns15:Audit>
                <ns15:MessagePath>
                    <ns15:Step>
                        <ns15:Application.Module>SDPMT.SDPMTProductUseQuery</ns15:Application.Module>
                        <ns15:VersionId>v5</ns15:VersionId>
                        <ns15:TimeStamp>${generate.dateNow}</ns15:TimeStamp>
                        <ns15:RoutingRole>START</ns15:RoutingRole>
                        <ns15:Comment></ns15:Comment>
                    </ns15:Step>
                    <ns15:Step>
                        <ns15:Application.Module>SDPMT.SDPMTProductUseQuery</ns15:Application.Module>
                        <ns15:VersionId>v5</ns15:VersionId>
                        <ns15:TimeStamp>${generate.dateNow}</ns15:TimeStamp>
                        <ns15:RoutingRole>SUCCESS</ns15:RoutingRole>
                        <ns15:Comment></ns15:Comment>
                    </ns15:Step>
                </ns15:MessagePath>
                <ns15:ProcessInfo>
                    <ns15:Name>androidMBPI</ns15:Name>
                </ns15:ProcessInfo>
            </ns15:Audit>
        </ns15:UCBRUHeaders>
    </ns2:Header>
    <ns2:Body>
        <ns14:SDPMTProductUse>
            <ns14:Code>SUCCESS</ns14:Code>
            <ns14:CustomerNo>${receive.id}</ns14:CustomerNo>
            <ns14:FirstName>МАРК</ns14:FirstName>
            <ns14:LastName>СЕКАМОВ</ns14:LastName>
            <ns14:MiddleName>АРКАДЬЕВИЧ</ns14:MiddleName>
            <ns14:Setting>
                <ns14:Identity>00792${receive.id}</ns14:Identity>
                <ns14:Status>Y</ns14:Status>
                <ns14:DefaultAccountIdentity>
                    <ns14:CBAccount>${AccountList.account2}</ns14:CBAccount>
                </ns14:DefaultAccountIdentity>
            </ns14:Setting>
            <ns14:AvailableAccounts>
                <ns14:AccountIdentity>
                    <ns14:CBAccount>${AccountList.account3}</ns14:CBAccount>
                </ns14:AccountIdentity>
                <ns14:Status>Y</ns14:Status>
            </ns14:AvailableAccounts>
            <ns14:AvailableAccounts>
                <ns14:AccountIdentity>
                    <ns14:CBAccount>${AccountList.account4}</ns14:CBAccount>
                </ns14:AccountIdentity>
                <ns14:Status>N</ns14:Status>
            </ns14:AvailableAccounts>
            <ns14:AvailableAccounts>
                <ns14:AccountIdentity>
                    <ns14:CBAccount>${AccountList.account5}</ns14:CBAccount>
                </ns14:AccountIdentity>
                <ns14:Status>N</ns14:Status>
            </ns14:AvailableAccounts>
        </ns14:SDPMTProductUse>
    </ns2:Body>
</ns2:Envelope>